# Agrupación de datos

In [2]:
import numpy as np
import pandas as pd

In [14]:
diccionario = {"dias":["dia1","dia1","dia2","dia2","dia3"],
               "vendedores":["Antonio","Maria","José","Marta","Juan"],
               "ventas":[100,400,200,500,300]}

In [15]:
dataframe = pd.DataFrame(diccionario)
dataframe

   dias vendedores  ventas
0  dia1    Antonio     100
1  dia1      Maria     400
2  dia2       José     200
3  dia2      Marta     500
4  dia3       Juan     300

In [16]:
dataframe.groupby("dias")

In [18]:
dataframe.groupby("dias").mean() #la media del valor total de cada dia

      ventas
dias
dia1     250
dia2     350
dia3     300

In [19]:
dataframe.groupby("dias").sum()

      ventas
dias
dia1     500
dia2     700
dia3     300

In [22]:
dataframe.groupby("dias").describe()

     ventas
      count   mean         std    min    25%    50%    75%    max
dias
dia1    2.0  250.0  212.132034  100.0  175.0  250.0  325.0  400.0
dia2    2.0  350.0  212.132034  200.0  275.0  350.0  425.0  500.0
dia3    1.0  300.0         NaN  300.0  300.0  300.0  300.0  300.0

In [23]:
dataframe.groupby("dias").describe().fillna(0)

     ventas
      count   mean         std    min    25%    50%    75%    max
dias
dia1    2.0  250.0  212.132034  100.0  175.0  250.0  325.0  400.0
dia2    2.0  350.0  212.132034  200.0  275.0  350.0  425.0  500.0
dia3    1.0  300.0    0.000000  300.0  300.0  300.0  300.0  300.0